{
  "advert": {
    "agency_name": "REQUIRED: The name of the real estate company advertising this property.",
    "agency_phone": "The telephone number of the real estate company's head office.",
    "agency_email": "REQUIRED: The email address of the real estate company's head office; a copy of all enquiries to this advert will be sent to this address.",
    "agency_website": "The website of the real estate company.",
    "agency_office_name": "The branch name (if applicable).",
    "agency_office_code": "The branch code (if applicable).",
    "agency_office_phone": "The branch telephone number (if applicable).",
    "agency_office_email": "The branch email address (if applicable); a copy of all enquiries to this advert will also be sent to this address if supplied.",
    "agent_name": "The name of the estate agent (agent commercial etc.) responsible for the property.",
    "agent_phone": "The direct / mobile telephone of the estate agent.",
    "agent_email": "The email address of the estate agent; a copy of all enquiries to this advert will also be sent to this address if supplied.",
    "reference": "REQUIRED: The estate agent's reference of the advert.",
    "status": "REQUIRED: Allows the estate agent to flag whether the advert should be online or offline. Used in cases where estate agents send through all properties and not just properties to advertise. Defaults to 'online'.",
    "url": "The URL of the advert on the estate agent's website.",
    "created_at": "When the advert was created on the estate agent's system; date-time in ISO 8601 combined date and time; i.e. yyyy-mm-ddThh:mm:ssZ https://en.wikipedia.org/wiki/ISO_8601#Combined_date_and_time_representations.",
    "updated_at": "When the advert was last updated on the estate agent's system; date-time in ISO 8601 combined date and time; i.e. yyyy-mm-ddThh:mm:ssZ https://en.wikipedia.org/wiki/ISO_8601#Combined_date_and_time_representations."
  },
  "property": {
    "status": "REQUIRED: The sale status of the property: for sale, withdrawn from market, under offer etc. Defaults to 'for sale'.",
    "title_en": "REQUIRED (either title_en or title_fr): The title of the advert in English; There is no maximum length, but please note that the titles will be cropped by the responsive templates in the advert search as required.",
    "title_fr": "REQUIRED (either title_en or title_fr): The title of the advert in French; There is no maximum length, but please note that the titles will be cropped by the responsive templates in the advert search as required.",
    "description_en": "REQUIRED (either description_en or description_fr): The description of the advert in English; New lines will be converted to <br />. Accepts the following HTML elements: <b><u><i><strong><em><ul><ol><li>.",
    "description_fr": "REQUIRED (either description_en or description_fr): The description of the advert in French; New lines will be converted to <br />. Accepts the following HTML elements: <b><u><i><strong><em><ul><ol><li>.",
    "highlights": "Short highlights about the property. No Length limit for each one, nor a limit for the total number that can be displayed, but we recommend to keep them short and sweet and not have more than 10.",
    "geo": {
      "user_data": {
        "location": "A brief description about the location of the property.",
        "commune_name": "REQUIRED * (see readme for explanation): The name of the commune where you wish to advertise the property as being located",
        "post_code": "REQUIRED * (see readme for explanation): The post code of the commune where you wish to advertise the property as being located.",
        "department_name": "REQUIRED * (see readme for explanation): The department name of the commune where you wish to advertise the property as being located.",
        "department_code": "REQUIRED * (see readme for explanation): The department code of the commune where you wish to advertise the property as being located."
      }
    },
    "price": {
      "amount": "The price in Euros",
      "currency": "Always listed as EUR",
      "comment": "Any comments about the price, such as 'Including agency fees'",
      "tenure": "The tenure of the property sale; 'life_annuity', 'fractional' etc. defaults to 'freehold'",
      "qualifier": "Information about the price offered; e.g. 'offers_in_excess_of', 'price_on_application' etc. defaults to 'asking_price"
    },
    "room_counts": {
      "total_rooms": "Total number of usable rooms in the property.",
      "total_bathrooms": "Total number of bathrooms in the property, i.e. sum of bathrooms and shower_rooms - not including water_closets.",
      "bedrooms": "Number of bedrooms in the property.",
      "bathrooms": "Number of full bathrooms in the property.",
      "reception_rooms": "Number of reception rooms (lounges, dining rooms, living rooms etc.) in the property.",
      "shower_rooms": "Number of shower rooms in the property.",
      "water_closets": "Number of separate toilets in the property."
    },
    "floor_area": {
      "size": "Total habitable floor size of the property, in metres squared."
    },
    "land_area": {
      "size": "Total size of the grounds of the property, in metres squared"
    },
    "energy_certificates": {
      "dpe": {
        "number": "The numeric value of the DPE certificate for the property.",
        "letter": "The letter value of the DPE certificate for the property.",
        "date": "The date that the DPE certificate was obtained."
      },
      "ges": {
        "number": "The numeric value of the GES certificate for the property.",
        "letter": "The letter value of the GES certificate for the property.",
        "date": "The date that the GES certificate was obtained."
      }
    },
    "attributes": {
      "types": "The type/s of the property being advertised. Try to also include a top-level type of 'residential' or 'business', or both in case of properties such as 'house with a gite', 'bed and breakfast' etc. If the property type is unknown, please leave this array empty.",
      "features": "Features of the property being advertised."
    },
    "images": [
      {
        "title": "Title of the image being displayed",
        "original_url": "URL of the image that you wish to display. We will take a copy of this and resize as required. We then serve copies of these images."
      }
    ],
    "floor_plans": "URLs of the floor plan image that you wish to display. We will take a copy of this and resize as required. We then serve copies of these images.",
    "virtual_tours": "URLs of the virtual tour that you wish to display. We do not host these and will link to them, or embed them within the advert display."
  }
}
